app/Controllers/Home.php

    public function login()
    {
        $username = $this->request->getPost('inputLogname');
        $password = $this->request->getPost('inputPassword');

        // Load the Session library
        $session = \Config\Services::session();

        // Load the UserModel
        $model = new UserModel();

        $user = $model->where('login_name', $username)->first();
---
SELECT *
FROM `user`
WHERE `login_name` = 'admin'
 LIMIT 1