app/Models/ProfileModel.php

    public function getAllProfiles()
    {
        return $this->findAll();
---
SELECT *
FROM `profile`

    public function getDashboardPermissionsByProfile($profileId)
    {
        $builder = $this->db->table('profiledashboard');
        $builder->select('profiledashboard_id, add_dashboard, view_dashboard, edit_dashboard, delete_dashboard');
        $builder->where('profile_id', $profileId);

        $permissions = $builder->get()->getResultArray();
---
SELECT `profiledashboard_id`, `add_dashboard`, `view_dashboard`, `edit_dashboard`, `delete_dashboard`
FROM `profiledashboard`
WHERE `profile_id` = '2'

    public function getVendorPermissionsByProfile($profileId)
    {
        $builder = $this->db->table('profilevendor');
        $builder->select('profilevendor_id, add_vendor, view_vendor, edit_vendor, delete_vendor');
        $builder->where('profile_id', $profileId);

        $permissions = $builder->get()->getResultArray();
---
SELECT `profilevendor_id`, `add_vendor`, `view_vendor`, `edit_vendor`, `delete_vendor`
FROM `profilevendor`
WHERE `profile_id` = '2'

    public function getLotnoPermissionsByProfile($profileId)
    {
        $builder = $this->db->table('profilelotno');
        $builder->select('profilelotNo_id, add_lotNo, view_lotNo, edit_lotNo, delete_lotNo');
        $builder->where('profile_id', $profileId);

        $permissions = $builder->get()->getResultArray();
---
SELECT `profilelotNo_id`, `add_lotNo`, `view_lotNo`, `edit_lotNo`, `delete_lotNo`
FROM `profilelotno`
WHERE `profile_id` = '2'

    public function getBondtransactionPermissionsByProfile($profileId)
    {
        $builder = $this->db->table('profilebondtransaction');
        $builder->select('profiletransaction_id, add_transaction, view_transaction, edit_transaction, delete_transaction');
        $builder->where('profile_id', $profileId);

        $permissions = $builder->get()->getResultArray();
---
SELECT `profiletransaction_id`, `add_transaction`, `view_transaction`, `edit_transaction`, `delete_transaction`
FROM `profilebondtransaction`
WHERE `profile_id` = '2'

    public function getReportPermissionsByProfile($profileId)
    {
        $builder = $this->db->table('profilereport');
        $builder->select('profilereport_id, add_report, view_report, edit_report, delete_report');
        $builder->where('profile_id', $profileId);

        $permissions = $builder->get()->getResultArray();
---
SELECT `profilereport_id`, `add_report`, `view_report`, `edit_report`, `delete_report`
FROM `profilereport`
WHERE `profile_id` = '2'

    public function getSettingPermissionsByProfile($profileId)
    {
        $builder = $this->db->table('profilesetting');
        $builder->select('profilesetting_id, add_setting, view_setting, edit_setting, delete_setting');
        $builder->where('profile_id', $profileId);

        $permissions = $builder->get()->getResultArray();
---
SELECT `profilesetting_id`, `add_setting`, `view_setting`, `edit_setting`, `delete_setting`
FROM `profilesetting`
WHERE `profile_id` = '2'

    public function getMembersByProfile($profileId)
    {
        $builder = $this->db->table('user');
        $builder->select('person_name');
        $builder->where('profile_id', $profileId);

        $query = $builder->get();
---
SELECT `person_name`
FROM `user`
WHERE `profile_id` = '2'